In [2]:
import pandas as pd
df = pd.read_csv("Decision tree salaries.csv")
df.head()

  company                  job     degree  salary_more_then_100k
0  google      sales executive  bachelors                      0
1  google      sales executive    masters                      0
2  google     business manager  bachelors                      1
3  google     business manager    masters                      1
4  google  computer programmer  bachelors                      0

In [4]:
inputs = df.drop('salary_more_then_100k',axis='columns')
target = df['salary_more_then_100k']

In [13]:
# Lets divide the   COLUMNS company	job	degree in DUMMY variables using LABEL encoder 

from sklearn.preprocessing import LabelEncoder
le_company = LabelEncoder()
le_job = LabelEncoder()
le_degree = LabelEncoder()

inputs['company_n'] = le_company.fit_transform(inputs['company'])
inputs['job_n'] = le_job.fit_transform(inputs['job'])
inputs['degree_n'] = le_degree.fit_transform(inputs['degree'])

inputs

# Now we can drop these string base columns 
inputs_n = inputs.drop(['company','job','degree'],axis='columns')
# inputs_n   # we got our X   -> input 
# target     # we got out y   -> output

In [8]:
# We can Use Decision tree Model Now
from sklearn.tree import DecisionTreeClassifier
model = DecisionTreeClassifier()
model.fit(inputs_n, target)
model.score(inputs_n,target)

1.0

In [21]:
from IPython.display import display, HTML

display(HTML("""<h4>Q Is salary of Google, Computer Engineer, Bachelors degree > 100 k ?"""))
model.predict([[2,1,0]])
display(HTML("""<h4>Answer is No -> array([0], dtype=int64)?"""))

display(HTML("""<h4> Q Is salary of Google, Computer Engineer, Masters degree > 100 k ?"""))
model.predict([[2,1,1]])
display(HTML("""<h4>Answer is yes -> array([1], dtype=int64)?"""))

C:\Users\tushar.m\Anaconda3\lib\site-packages\sklearn\base.py:450: UserWarning: X does not have valid feature names, but DecisionTreeClassifier was fitted with feature names
  warnings.warn(

C:\Users\tushar.m\Anaconda3\lib\site-packages\sklearn\base.py:450: UserWarning: X does not have valid feature names, but DecisionTreeClassifier was fitted with feature names
  warnings.warn(

In [9]:
from IPython.display import display, HTML
display(HTML("""
<h4>From the  following columns build a model to predict if person would survive or not,
</br> </br>
Pclass Sex Age Fare </br> </br>
Calculate score of your model !</h4>
"""
            ))

In [36]:
import pandas as pd
df = pd.read_csv("Decision Tree titanic.csv")
df.head()

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S
4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S

In [37]:
df.groupby('Survived').mean()

          PassengerId    Pclass        Age     SibSp     Parch       Fare
Survived
0          447.016393  2.531876  30.626179  0.553734  0.329690  22.117887
1          444.368421  1.950292  28.343690  0.473684  0.464912  48.395408

In [91]:
#       pre - processing 

# any(df.Embarked.isnull())
# CHECK ALL COLUMNS WHICH ARE NULL == # df.isnull().sum()
df.isnull().sum()

# df.Cabin.mean()
# df.Age.mean()
# df.Embarked.mean()

#  Here our inputs are          Pclass Sex Age Fare
# SO since age has Nan values , lets fill them up with mean value
df.Age = df.Age.fillna(df.Age.mean())

df
# df.isnull().sum()   # we can confim here , our age is filled with mean 


# Now since Sex column is  in string, let use Label ENcoder 

from sklearn.preprocessing import LabelEncoder
le_Sex = LabelEncoder()
inputs = df[['Pclass','Sex','Age','Fare']]
# inputs['Sex'] = le_Sex.fit_transform(inputs['Sex'])  # replace the Sex column with label_encoders 
inputs

# output = df['Survived']
# Successfully all our inputs are generated with the output too in numeric format,
# we can proceed with the testing and training of the data 

# pd.crosstab(inputs['Sex'],df['Survived']).plot(kind='bar') 
### >>> Female survivors are more than Male Survivors

     Pclass     Sex        Age     Fare
0         3    male  22.000000   7.2500
1         1  female  38.000000  71.2833
2         3  female  26.000000   7.9250
3         1  female  35.000000  53.1000
4         3    male  35.000000   8.0500
..      ...     ...        ...      ...
886       2    male  27.000000  13.0000
887       1  female  19.000000  30.0000
888       3  female  29.699118  23.4500
889       1    male  26.000000  30.0000
890       3    male  32.000000   7.7500

[891 rows x 4 columns]

In [77]:
from sklearn.model_selection import train_test_split
X_train, X_test, y_train, y_test = train_test_split(inputs, output, test_size=0.2)
X_train.shape, X_test.shape

((712, 4), (179, 4))

In [78]:
from sklearn.tree import DecisionTreeClassifier
model = DecisionTreeClassifier()
model.fit(X_train, y_train)

DecisionTreeClassifier()

In [84]:
# model.predict(X_test)
model.score(X_test, y_test)

0.7988826815642458